In [1]:
import pandas as pd
import numpy as np
from numpy import nan

In [4]:
dates = pd.date_range('2019-07-01','2019-07-08')

In [5]:
obj = pd.Series([34,56,89,99,90,65,23,10], index = dates)
obj2 = pd.Series([45,66,78,55,12,34,89,98], index = dates)

In [6]:
money = pd.DataFrame({'Monday':obj,'Tuesday':obj2})
money

            Monday  Tuesday
2019-07-01      34       45
2019-07-02      56       66
2019-07-03      89       78
2019-07-04      99       55
2019-07-05      90       12
2019-07-06      65       34
2019-07-07      23       89
2019-07-08      10       98

In [9]:
ab =money['Monday']
ab

2019-07-01    34
2019-07-02    56
2019-07-03    89
2019-07-04    99
2019-07-05    90
2019-07-06    65
2019-07-07    23
2019-07-08    10
Freq: D, Name: Monday, dtype: int64

In [10]:
ab['2019-07-03':'2019-07-06']

2019-07-03    89
2019-07-04    99
2019-07-05    90
2019-07-06    65
Freq: D, Name: Monday, dtype: int64

In [11]:
diff = money.Monday - money.Tuesday

In [12]:
diff

2019-07-01   -11
2019-07-02   -10
2019-07-03    11
2019-07-04    44
2019-07-05    78
2019-07-06    31
2019-07-07   -66
2019-07-08   -88
Freq: D, dtype: int64

In [13]:
money['Wednesday'] = diff
money

            Monday  Tuesday  Wednesday
2019-07-01      34       45        -11
2019-07-02      56       66        -10
2019-07-03      89       78         11
2019-07-04      99       55         44
2019-07-05      90       12         78
2019-07-06      65       34         31
2019-07-07      23       89        -66
2019-07-08      10       98        -88

In [14]:
money['Thursday'] = money.Monday * money.Tuesday

In [15]:
money

            Monday  Tuesday  Wednesday  Thursday
2019-07-01      34       45        -11      1530
2019-07-02      56       66        -10      3696
2019-07-03      89       78         11      6942
2019-07-04      99       55         44      5445
2019-07-05      90       12         78      1080
2019-07-06      65       34         31      2210
2019-07-07      23       89        -66      2047
2019-07-08      10       98        -88       980

In [16]:
money.Monday['2019-07-03':'2019-07-06']

2019-07-03    89
2019-07-04    99
2019-07-05    90
2019-07-06    65
Freq: D, Name: Monday, dtype: int64

In [17]:
money.iloc[-1]

Monday        10
Tuesday       98
Wednesday    -88
Thursday     980
Name: 2019-07-08 00:00:00, dtype: int64

In [18]:
money.loc['2019-07-07']

Monday         23
Tuesday        89
Wednesday     -66
Thursday     2047
Name: 2019-07-07 00:00:00, dtype: int64

In [24]:
money.Wednesday[money.Wednesday<0]

2019-07-01   -11
2019-07-02   -10
2019-07-07   -66
2019-07-08   -88
Name: Wednesday, dtype: int64

In [27]:
money.Wednesday[[0,1,-1]]

2019-07-01   -11
2019-07-02   -10
2019-07-08   -88
Name: Wednesday, dtype: int64

In [28]:
money.head() #brings first n numbers of the data, default value of n is 5

            Monday  Tuesday  Wednesday  Thursday
2019-07-01      34       45        -11      1530
2019-07-02      56       66        -10      3696
2019-07-03      89       78         11      6942
2019-07-04      99       55         44      5445
2019-07-05      90       12         78      1080

In [29]:
money.tail() #brings last n numbers of the data, default value of n is 5

            Monday  Tuesday  Wednesday  Thursday
2019-07-04      99       55         44      5445
2019-07-05      90       12         78      1080
2019-07-06      65       34         31      2210
2019-07-07      23       89        -66      2047
2019-07-08      10       98        -88       980

In [30]:
money.head(2).Monday

2019-07-01    34
2019-07-02    56
Freq: D, Name: Monday, dtype: int64

In [31]:
q = pd.Series([2,4,6,65,32], pd.RangeIndex (start = 0, stop = 10, step = 2))
q

0     2
2     4
4     6
6    65
8    32
dtype: int64

In [33]:
name = pd.Series(["Hassan","Amjad","Abdullah","Shayan","Imran"])

In [49]:
Biodata = pd.DataFrame(
    {'Name':["Hassan","Amjad","Abdullah","Shayan","Imran"],
                        'Age':np.random.randint(20,55,5),
                        'Percentage':np.random.randint(50,100,5)})
Biodata

SyntaxError: invalid syntax (<ipython-input-49-11e5e2e8b27f>, line 1)